app/Controllers/admin/AboutController.php

SELECT *
FROM `about`
WHERE `about`.`id` = 1
---
    public function index()
    {
        $model = new AboutModel();
        $record = $model->find(1);