app/Controllers/admin/BrandsController.php

    public function store()
    {
        $brandModel = new BrandModel();
        $data = [
            'b_name' => $this->request->getPost('b_name'),
            'b_desc' => $this->request->getPost('b_desc'),
            'b_status' => $this->request->getPost('b_status'),
        ];
        $brandModel->insert($data);
---
INSERT INTO `brands` (`b_name`, `b_desc`, `b_status`) VALUES ('Lenovo', 'Lenovo', '1')