app/Controllers/admin/BrandsController.php

    public function index()
    {
         if (!session()->has('username')) {
            return redirect()->to(base_url('login'));
        }
        $brandModel = new BrandModel();
        $data['brands'] = $brandModel->findAll();
---
SELECT *
FROM `brands`

    public function edit($id)
    {
        $brandModel = new BrandModel();
        $data['brand'] = $brandModel->find($id);
---
SELECT *
FROM `brands`
WHERE `brands`.`b_id` = '3'

        // Add the thumbnail name to the data array
        $data['img'] = $imgName;
    }
        $brandModel->update($id, $data);
---
UPDATE `brands` SET `b_name` = 'Apple', `b_desc` = 'Apple', `b_status` = '1'
WHERE `brands`.`b_id` IN ('3')