app/Controllers/admin/EnquiriesController.php

    public function index()
    {
        if (!session()->has('username')) {
            return redirect()->to('/login');
        }

        $enquiryModel = new EnquiryModel();
        $data['enquiries'] = $enquiryModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `enquiries`
ORDER BY `id` DESC