app/Controllers/admin/ModelController.php

SELECT `models`.*, `brands`.`b_name`
FROM `models`
LEFT JOIN `brands` ON `brands`.`b_id` = `models`.`b_id`
---
    public function index()
    {

        $modelModel = new \App\Models\ModelModel();
        $brandModel = new \App\Models\BrandModel();
        $models = $modelModel
    ->select('models.*, brands.b_name')
    ->join('brands', 'brands.b_id = models.b_id', 'left')
    ->findAll();

SELECT *
FROM `product`
---
    public function create()
{
$brandModel = new \App\Models\BrandModel();
$productModel = new \App\Models\ProductModel();

$product = $productModel->findAll();

SELECT *
FROM `models`
WHERE `models`.`id` = '1'
SELECT *
FROM `model_gallery`
WHERE `model_id` = '1'
SELECT *
FROM `product`
---
    public function edit($id)
    {
        $modelModel = new \App\Models\ModelModel();
        $galleryModel = new \App\Models\ModelGalleryModel();
        $productModel = new \App\Models\ProductModel();
        $brandModel = new \App\Models\BrandModel();

        $brand = $brandModel->findAll();


        $model = $modelModel->find($id);
        $gallery = $galleryModel->where('model_id', $id)->findAll();
        $product = $productModel->findAll();