app/Controllers/admin/ModelController.php

SELECT *
FROM `models`
---
    public function index()
    {

        $modelModel = new \App\Models\ModelModel();
        $models = $modelModel->findAll();