app/Controllers/admin/ProductController.php

SELECT *
FROM `product`
---
    public function index()
    {
         if (!session()->has('username')) {
            return redirect()->to('/login');
        }
        $ProductModel = new ProductModel();
        $data['product'] = $ProductModel->findAll();