app/Controllers/admin/SliderController.php

    public function index()
    {
        if (!session()->has('username')) {
            return redirect()->to('/login');
        }
        $model = new SliderModel();
        $data['records'] = $model->findAll();
---
SELECT *
FROM `slider`

    public function edit($id)
    {
        $model = new SliderModel();
        $data['record'] = $model->find($id);
---
SELECT *
FROM `slider`
WHERE `slider`.`id` = '4'