app/Views/templates/footer.php

            $uri = 'home';
        }

        $seo = $db->table('seo_settings')->where('page_route', $uri)->get()->getRowArray();

        if (!$seo) {
            $allModels = $db->table('models')->get()->getResultArray();
---
SELECT *
FROM `seo_settings`
WHERE `page_route` = 'asus-rog'
SELECT *
FROM `models`

            $seo = $db->table('seo_settings')->where('page_route', 'home')->get()->getRowArray();
        }

        $globalScripts = $db->table('seo_settings')->where('page_route', 'home')->get()->getRowArray();
---
SELECT *
FROM `seo_settings`
WHERE `page_route` = 'home'

        echo $footerCode;

        // Render Home Footer Custom Scripts
        $homeRecordForScript = $db->table('home')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `home`
WHERE `id` = 1