app/Views/templates/headermenu.php

SELECT `models`.*, `brands`.`b_name`
FROM `models`
LEFT JOIN `brands` ON `brands`.`b_id` = `models`.`b_id`
WHERE `models`.`type` = '1'
AND `models`.`status` = 1
SELECT `models`.*, `brands`.`b_name`
FROM `models`
LEFT JOIN `brands` ON `brands`.`b_id` = `models`.`b_id`
WHERE `models`.`type` = '2'
AND `models`.`status` = 1
---
$db = db_connect();

// Fetch Laptops (type=1)
$laptops = $db->table('models')
    ->select('models.*, brands.b_name')
    ->join('brands', 'brands.b_id = models.b_id', 'left')
    ->where('models.type', '1')
    ->where('models.status', 1)
    ->get()->getResultArray();

// Fetch Desktops (type=2)
$desktops = $db->table('models')
    ->select('models.*, brands.b_name')
    ->join('brands', 'brands.b_id = models.b_id', 'left')
    ->where('models.type', '2')
    ->where('models.status', 1)
    ->get()->getResultArray();

SELECT *
FROM `models`
---
    $activeMenu = 'contact';
} else {
    // Check if it matches a product model to highlight the correct catalog section
    $modelRow = $db->table('models')->get()->getResultArray();