app/Views/templates/header.php

}

// 1. Try to find a matching route in seo_settings
$seo = $db->table('seo_settings')->where('page_route', $uri)->get()->getRowArray();

// 2. If not found in seo_settings, check if it matches a product model slug
if (!$seo) {
    $allModels = $db->table('models')->get()->getResultArray();
---
SELECT *
FROM `seo_settings`
WHERE `page_route` = 'asus-rog'
SELECT *
FROM `models`

}

// 4. Resolve settings with global defaults for scripts
$globalScripts = $db->table('seo_settings')->where('page_route', 'home')->get()->getRowArray();
---
SELECT *
FROM `seo_settings`
WHERE `page_route` = 'home'

        <?= $schemaCode ?>
        <?= $headerCode ?>
        <?php
        $homeRecordForScript = $db->table('home')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `home`
WHERE `id` = 1