app/Controllers/Pages.php

SELECT *
FROM `services`
WHERE `status` = 1
---
    public function services()
    {
        $serviceModel = new ServiceModel();
        $data['services'] = $serviceModel->where('status', 1)->findAll();

SELECT *
FROM `models`
SELECT *
FROM `brands`
WHERE `brands`.`b_id` = '8'
SELECT *
FROM `model_gallery`
WHERE `model_id` = '2'
---
    public function viewModel($slug)
    {
        $modelModel = new ModelModel();
        $galleryModel = new ModelGalleryModel();
        $brandModel = new BrandModel();

        // Find the matching model by slugified name comparison
        $allModels = $modelModel->findAll();
        $foundModel = null;
        foreach ($allModels as $m) {
            $cleanedName = str_replace(' ', '-', strtolower(trim($m['name'])));
            if ($cleanedName === strtolower($slug)) {
                $foundModel = $m;
                break;
            }
        }

        if (!$foundModel) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Product not found: " . esc($slug));
        }

        // Fetch brand
        $foundModel['brand'] = $brandModel->find($foundModel['b_id']);

        // Fetch gallery images
        $gallery = $galleryModel->where('model_id', $foundModel['id'])->findAll();

SELECT *
FROM `models`
WHERE `models`.`id` = '2'
---
    public function cartAdd($id)
    {
        $modelModel = new ModelModel();
        $product = $modelModel->find($id);